Autodesk.Revit.DB.ChangeType.Contains(Autodesk.Revit.DB.ChangeType)
Checks whether this ChangeType contains the input ChangeType
Returns:
True if input changeType is contained by this ChangeType
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ChangeType.IsIdentical(Autodesk.Revit.DB.ChangeType)
Compares if two ChangeTypes are identical
changeType:
Input ChangeType to be compared
Returns:
True if the this ChangeType and input ChangeType are identical
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ChangeType.ConcatenateChangeTypes(Autodesk.Revit.DB.ChangeType,Autodesk.Revit.DB.ChangeType)
Creates a ChangeType that is a union of the two input ChangeTypes
changeType1:
First input ChangeType to be concatenated
changeType2:
Second input ChangeType to be concatenated
Returns:
A new ChangeType that is a concatenation/union of the input change types
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ChangeType.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ChangeType
A class representing a change that can be detected and tracked during Dynamic Update.
Remarks:
ChangeTypes for specific changes can be obtained from the static methods available on
Autodesk.Revit.DB.Element.
Since:
2011